R/curve.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-24 火 22:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>確率統計2022 R 入門 確率分布関数の描画</title>
<meta name="author" content="suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">確率統計2022 R 入門 確率分布関数の描画</h1>


<div id="outline-container-org333e448" class="outline-2">
<h2 id="org333e448">参考</h2>
<div class="outline-text-2" id="text-org333e448">
<ul class="org-ul">
<li><a href="http://www.f.waseda.jp/sakas/R/Rcalculation.html#stat">http://www.f.waseda.jp/sakas/R/Rcalculation.html#stat</a></li>
<li><a href="https://ai-trend.jp/programming/r-beginner/normal-distribution-2/">正規分布のグラフをRで描く。【curve()の使い方】 | AVILEN AI Trend</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5b1e5fb" class="outline-2">
<h2 id="org5b1e5fb">連続一様分布</h2>
<div class="outline-text-2" id="text-org5b1e5fb">
<p>
dunif: 連続一様確率密度関数， パラメータ min, max
</p>

<div class="org-src-container">
<pre class="src src-R">
curve(dunif(x,1,2), 0,4, main=<span style="color: #95e454;">"&#36899;&#32154;&#19968;&#20998;&#24067;&#27096;"</span>)
curve(dunif(x,1,3), 0,4, col=<span style="color: #95e454;">"red"</span>, add=T)

</pre>
</div>
</div>
</div>


<div id="outline-container-org2da5d06" class="outline-2">
<h2 id="org2da5d06">二項分布</h2>
<div class="outline-text-2" id="text-org2da5d06">
<p>
dbinom: size, prob
</p>

<div class="org-src-container">
<pre class="src src-R">
curve(dbinom(x,size=100,prob=0.5), 0, 100, main=<span style="color: #95e454;">"&#20108;&#38917;&#20998;&#24067;"</span>)


</pre>
</div>
</div>
</div>

<div id="outline-container-org5a7a11a" class="outline-2">
<h2 id="org5a7a11a">ポアソン分布</h2>
<div class="outline-text-2" id="text-org5a7a11a">
<p>
dpois: lambda (頻度)
</p>

<div class="org-src-container">
<pre class="src src-R">
curve(dpois(x,lambda=3), 0, 20, main=<span style="color: #95e454;">"&#12509;&#12450;&#12477;&#12531;&#20998;&#24067;"</span>,col=1)
curve(dpois(x,lambda=10), 0, 20, col=2,add=T)
legend(c(<span style="color: #95e454;">"lambda=3"</span>, <span style="color: #95e454;">"lambda=10"</span>:),col=1:2)


</pre>
</div>

<pre class="example">
50 件以上の警告がありました (最初の 50 個の警告を見るには warnings() を使って下さい)
50 件以上の警告がありました (最初の 50 個の警告を見るには warnings() を使って下さい)
エラー:   予想外の ')' です  ( "legend(c("lambda=3", "lambda=10":)" の)
</pre>
</div>
</div>

<div id="outline-container-orgb9dc151" class="outline-2">
<h2 id="orgb9dc151">正規分布</h2>
<div class="outline-text-2" id="text-orgb9dc151">
<p>
dbinom: size, prob
</p>

<div class="org-src-container">
<pre class="src src-R">
curve(dnorm(x,mean=50,sd=5), 0, 100, main=<span style="color: #95e454;">"&#20108;&#38917;&#20998;&#24067;"</span>)

</pre>
</div>
</div>
</div>


<div id="outline-container-org612a231" class="outline-2">
<h2 id="org612a231">二項分布と正規分布</h2>
<div class="outline-text-2" id="text-org612a231">
<p>
dbinom: size, prob
</p>

<div class="org-src-container">
<pre class="src src-R">
curve(dnorm(x,mean=50,sd=5), 0, 100, main=<span style="color: #95e454;">"&#20108;&#38917;&#20998;&#24067;&#12392;&#27491;&#35215;&#20998;&#24067;"</span>,col=<span style="color: #95e454;">"blue"</span>)
curve(dbinom(x,size=100,prob=0.5), 0, 100, add=T, col=<span style="color: #95e454;">"red"</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgcd8c517" class="outline-2">
<h2 id="orgcd8c517">項分布とポアソン分布</h2>
<div class="outline-text-2" id="text-orgcd8c517">
<p>
２項分布のパラメータ n, p の n が大きく、np がほどほどの時、ポアソン分
布で近似できることを視覚的に確認する。
</p>

<p>
グラフを重ねるには低水準作図関数の lines 関数を使う。
</p>

<ul class="org-ul">
<li>dbinom 関数は2項分布の質量関数、</li>
<li>qbinom 関数は2項分布の累積分布関数の逆関数で、この場合は下側 0.1%点、上側 99.9%点を求めている。</li>
<li>plot 関数の type="h" オプションは棒グラフを描き、</li>
<li>lwd= オプションは線の太さを指定する。</li>
<li>qpois 関数はポアソン分布の質量関数。</li>
</ul>

<div class="org-src-container">
<pre class="src src-R">
n = 1000
p = 0.02
na = qbinom(0.001, n, p)
nb = qbinom(0.999, n, p)
plot(na:nb, dbinom(na:nb,n,p), type=<span style="color: #95e454;">"h"</span>, lwd=3, main=paste(<span style="color: #95e454;">"n ="</span>, n, <span style="color: #95e454;">", p ="</span>,p))
lines(na:nb, dpois(na:nb, n*p), col = 2)
abline(h=0)
text(30, 0.085, <span style="color: #95e454;">"&#25240;&#12428;&#32218;&#12399;&#12509;&#12450;&#12477;&#12531;&#20998;&#24067;"</span>)

</pre>
</div>

<p>
次は、n=1000, p=0.2 とした場合の作図例である。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師</p>
<p class="date">Created: 2022-05-24 火 22:23</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
